const categories  = ["Комедия","Драмма","Ужасы","Фантастика","Сериалы"];
const countries = ["USA","Russia","United Kingdom","France","Canada","Spain","Germany","Europe"];
const nameauthor = ["Zeus","Poseidon","Afrodita","Venera","Gera","Ares","Afina","Hephaestus","Demetra","Apollo","Artemida","Gastia","Hermes","Hades","Persephone"];
const base_comm = {
    bad_comm :
        ["Чушь и муть. Жалко потраченного времени на это недокино.",
        "Абсолютный провал. Игра актеров никакая. Многие зрители вставали и уходили с половины фильма.",
        "Фильм провааал, просто понимаете, там нету логичных сюжетов, фильм сделали из многих стыренных идей других фильмов, зря потраченные деньги будут, если пойдёте....",
        "Вчера посмотрели всей семьей эту муру , и пишу чтобы другие не тратили своё время и деньги, зря . Фильм муть полная, кроме музыки ",
        "Теперь я поняла,почему зал был пуст, кроме нас 2-х никого... Одно утешает_ билет не дорогой!...",
        "Шок. г... редкостное! Позор!...",
        "Есть фильмы где нет сюжета, но есть игра актеров, или красивый видеоряд, музыка. Здесь нет ничего."
        ],
    average_comm :
        ["Скучный фильм. Эмоциональный уровень актеров как у зубочистки. Их игра неестествена. ",
        "Резюмируя, это дешевый продукт в привлекательной упаковке. За упаковку ставлю заслуженные.",
        "Стоит ли смотреть данный фильм и есть ли в нем смысл? Однозначно да, но не возлагайте на него никаких надежд. И если вдруг во время просмотра у вас возникнет желание его выключить и начать смотреть что-то более полезное и интеллектуальное, то так и сделайте.",
        "К сожалению, картина ориентирована на слишком широкую аудиторию. ",
        "Атмосферный фильм, не более того.",
        "Не впечатлил, много слов, сюжет да фигня....",
        "Неоднозначный, но мне понравился. Пейзаж, музыка, атмосфера."],
    great_comm :
        ["Фильм-мотивация, фильм-вдохновение, занимательная история с прекрасным актерским составом и, кстати, заслуживающим внимания саундтреком.",
        "Это великолепное кино способно сделать мир вокруг лучше, светлее, а зрителя — чуточку счастливее. Смахнуть слёзы и понять, что надежда — есть, и никогда нельзя отчаиваться.",
        "Отличный фильм, то, что происходит в фильме близко каждому зрителю. Фильм затрагивает все струны души зрителя. Бесконечно признательна режиссеру.",
        "Отличная картина. Фильм наводит на размышления,абсолютно не похож ни что другое....",
        "Фильм оч понравился! Рекомендую к просмотру!...",
        "Классный фильм захватывает с первых минут просмотра советую посмотреть....",
        "Отличный фильм. Полностью погружаешься в действие, хотя оно и неспешное."]
};
const films = [];
const baserate = 5.0;
const x = 0;
const y = 0;
class film {
    constructor ( name, cat, date, country, director){
        this.name = name;
        this.rate = baserate;
        this.category = categories [ cat ];
        this.date = date;
        this.country = countries [ country ];
        this.director = director;
        this.comments = []
    }
    //заменить местами text, rate, authorname
    addComent ( authorname, rate, text) {
        this.comments.push( new comm(authorname, rate, text) );
    }
}
// заменить местами text, rate, authorname
class comm {
    constructor (  authorname, rate, text ) {
        this.text = text;
        this.author = nameauthor[ authorname ];
        this.rate = rate;
    }
}
//Выбор случайного имени коментатора
function nameaut () {
    z = Math.floor(Math.random() * nameauthor.length);
    return(z);
}
//Выбор случайной оценки
function rateran (x) {
    x = Math.floor(Math.random() * (10 - 1 + 1)) + 1;
    return(x);
}
//Выбор коментария от оценки фильма
function commran (y) {
    if ( x <= 3 ) {
        y = Math.floor(Math.random() * base_comm.bad_comm.length);
    }
    else if ( x >= 4 && x <= 6 ) {
        y = Math.floor(Math.random() * base_comm.average_comm.length);
    }
    else {
        y = Math.floor(Math.random() * base_comm.great_comm.length);
    }
    return(y);
}
films.push( new film("Интерстеллар", 3, "2014", 0, "Кристофер Нолан"));
films.push( new film("1+1",1,"2011",3,"Оливье Накаш"));
films.push( new film("Карты, деньги, два ствола", 0,"1998", 2, "Гай Ричи"));
films.push( new film("Сонная Лощина", 2, "1999", 0, "Тим Бёртон"));
films.push( new film("Шерлок", 4, "2010", 2, "Пол МакГиган"));
films[0].addComent(nameaut(), rateran(x), commran(y));
console.log(y);
console.log(films[0].comments);
/*films[1].addComent("Каждый, кто посмотрел «1+1», находит в нем что-то свое, но в любом случае, позитивное и оптимистичное, чего порой не хватает в нашей жизни.", nameaut(), rateran(x));
films[2].addComent("«Карты, деньги, два ствола» — просто бесподобный, очень интересный, увлекательный, крутой криминальный боевик, который можно бесспорно вносить в коллекцию избранных фильмов.", nameaut(), rateran(x));
films[3].addComent("Любителям готических историй и страшных сказок, а также поклонникам Тима Бертона и Джонни Деппа рекомендую к обязательному просмотру.", nameaut(), rateran(x));
films[4].addComent("«Шерлок» — лучший в своем жанре, интересный, захватывающий сериал, в отличным подбором актеров, сюжетом и с долей юмора. С нетерпением жду последующих частей!", nameaut(), rateran(x));*/
for (let i = 0; i < films.length; i++) {
    console.log("Name: " +  films[i].comments[0].author + ". Stars: " + films[i].comments[0].rate );
    console.log("Comment: " + films[i].comments[0].text );
    console.log("");
}
console.log(base_comm.average_comm.length);
console.log(base_comm.bad_comm.length);
console.log(base_comm.great_comm.length);





//сделать возрат сразу комента из базы в функции рандомного комента


/*films[0].addComent(nameaut(), rateran(x), commran(y));
films[1].addComent("Каждый, кто посмотрел «1+1», находит в нем что-то свое, но в любом случае, позитивное и оптимистичное, чего порой не хватает в нашей жизни.", nameaut(), rateran(x));
films[2].addComent("«Карты, деньги, два ствола» — просто бесподобный, очень интересный, увлекательный, крутой криминальный боевик, который можно бесспорно вносить в коллекцию избранных фильмов.", nameaut(), rateran(x));
films[3].addComent("Любителям готических историй и страшных сказок, а также поклонникам Тима Бертона и Джонни Деппа рекомендую к обязательному просмотру.", nameaut(), rateran(x));
films[4].addComent("«Шерлок» — лучший в своем жанре, интересный, захватывающий сериал, в отличным подбором актеров, сюжетом и с долей юмора. С нетерпением жду последующих частей!", nameaut(), rateran(x));*/
